# RoomLightingLoadUnitsParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RoomLightingLoadUnitsParam Property
ParameterTypeId Class See Also
---
"Lighting Load Units"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RoomLightingLoadUnitsParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RoomLightingLoadUnitsParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RoomLightingLoadUnitsParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace